Table of Contents
 Interface IIdeaCombiInput
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
public interface IIdeaCombiInput : IIdeaLoading, IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 CombiItems
List<IIdeaCombiItem> CombiItems { get; }
Property Value
List<IIdeaCombiItem>
 TypeCalculationCombi
Type of combination
TypeCalculationCombiEC TypeCalculationCombi { get; }
Property Value
TypeCalculationCombiEC
 TypeCombiEC
Type of EC combination
TypeOfCombiEC TypeCombiEC { get; }
Property Value
TypeOfCombiEC
 Edit this page